---
kind: property
id: P:Autodesk.Revit.DB.Plane.XVec
source: html/94bf72b9-4df7-07f2-00d9-8b350622695a.htm
---
# Autodesk.Revit.DB.Plane.XVec Property

Axis defining the first parametric direction of the plane.

## Syntax (C#)
```csharp
public XYZ XVec { get; }
```